Documentation/gcdc16_local_message_set.tex
% Created 2015-09-13 Sun 20:01
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Albin Severinson}
\date{\today}
\title{GCDC16 Local Message Set}
\hypersetup{
 pdfauthor={Albin Severinson},
 pdftitle={GCDC16 Local Message Set},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 24.4.1 (Org mode 8.3.1)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\begin{center}
\begin{tabular}{lrl}
Version: & 0.1 & First draft\\
 & 0.2 & Revised CAM and added DENM\\
 & 0.3 & Added iCLCM\\
 & 0.4 & Rewrote introduction\\
\end{tabular}
\end{center}

\newpage
\section{Introduction}
\label{sec:orgheadline1}
This document presents the local message set (LMS) to be used for
GCDC16. The LMS is used for sending and receiving CAM/DENM/iCLCM
from/to the vehicle control system implemented in Simulink.

The communication stack includes a vehicle adapter that will receive
these messages and use them to create proper CAM/DENM/iCLCM
that will be forwarded to other vehicles and vice versa. The LMS
follows the ETSI specification as closely as possible, but makes some
changes to make is possible to create the messages in Simulink.

Every message type has a corresponding local message that is used for
creating that specific message. 

All local messages are of identical length, and bit masks are used to
handle messages with optional containers. The bit mask is set to
indicate which of the optional fields are present. If the bit mask
indicates that the field is not present, its value is undefined.

All data is in network byte order, which is identical to big endian.

\newpage
\section{CAM}
\label{sec:orgheadline2}
CAM messages are created by the vehicle adapter using the data fields
present in a local CAM message as detailed below. CAM messages have
both mandatory and optional data fields, where the optional data
fields are contained in the low frequency container. The container
mask is a bit mask that indicates whether this container is present.
Note that the optional fields in the local CAM message always are
present. However their values are undefined if they are not indicated
as present.

\begin{center}
\begin{tabular}{rll}
\hline
Bytes: & Data: & Notes\\
\hline
1 & Header & \(=2\) for CAM\\
1 & Container Mask & \\
4 & GenerationDeltaTime & See D3.2\\
4 & Station Type & See D3.2\\
4 & (opt) Vehicle Role & See D3.2\\
4 & Vehicle Length & See D3.2\\
4 & Vehicle Width & See D3.2\\
4 & Latitude & See D3.2\\
4 & Longitude & See D3.2\\
4 & Semi Major Confidence & See D3.2\\
4 & Semi Minor Confidence & See D3.2\\
4 & Semi Major Orientation & See D3.2\\
4 & Heading & See D3.2\\
4 & Heading confidence 95\% & See D3.2\\
4 & Altitude & Not in D3.2?\\
4 & Speed & See D3.2\\
4 & Speed Confidence 95\% & See D3.2\\
4 & Yaw Rate & See D3.2\\
4 & Yaw Rate Confidence 95\% & See D3.2\\
4 & Longitudinal vehicle acceleration & See D3.2\\
4 & Longitudinal vehicle acceleration confidence 95\% & See D3.2\\
 &  & \\
\end{tabular}
\end{center}


\newpage
\section{DENM}
\label{sec:orgheadline3}
The first part of the message, after the header, is a bit mask that
indicates which of the optional containers that are present. The
containers also start with a bit mask to indicate which of the
optional data fields inside that container are used. Data fields
marked as unused by the bit mask can have arbitrary values as they are
ignored by the communication stack. This also means that every local
DENM message has the same size, making it easier to use in Simulink.

\begin{center}
\begin{tabular}{lrll}
Message part: & Bytes: & Data: & Notes:\\
\hline
Header & 1 & Message ID & \(=1\) for DENM\\
\hline
Container Mask & 1 & ContainerMask & \\
\hline
Management Container & 1 & ManagementMask & \\
 & 8 & DetectionTime & \\
 & 8 & ReferenceTime & \\
 & 4 & (opt) Termination & \\
 & 24 & EventPosition & \\
 & 4 & (opt) RelevanceDistance & \\
 & 4 & (opt) RelevanceTrafficDirection & \\
 & 4 & (opt) ValidityDuration & \\
 & 4 & (opt) TransmissionIntervall & \\
 & 4 & StationType & \\
\hline
(opt)Situation Container & 1 & SituationMask & \\
 & 4 & InformationQuality & \\
 & 8 & CauseCode & \\
 & 8 & (opt) LinkedCauseCode & \\
 & 0 & (opt) EventHistory & Not implemented\\
\hline
(opt) Location Container & 0 & LocationMask & Not implemented\\
 & 0 & (opt) EventSpeed & Not implemented\\
 & 0 & (opt) EventPositionheading & Not implemented\\
 & 0 & Traces & Not implemented\\
 & 0 & (opt) RoadType & Not implemented\\
\hline
(opt) Alacarte Container & 1 & AlacarteMask & \\
 & 4 & (opt) LanePosition & See D3.2\\
 & 0 & (opt) ImpactReducationContainer & Not implemented\\
 & 4 & (opt) ExternalTemperature & \\
 & 0 & (opt) RoadWorksContainerExtended & Not implemented\\
 & 4 & (opt) PositioningSolution & \\
 & 0 & (opt) StationaryVehicleContainer & Not implemented\\
 &  &  & \\
\end{tabular}
\end{center}
\newpage

\section{iCLCM}
\label{sec:orgheadline4}
The iGAME Cooperative Lane Changing Message (iCLCM) is structured very
similarly to CAM. It consists of a base message with additional
containers added for various events or scenarios. As with the other
message types, iCLCM are created by sending a corresponding local
message to the vehicle adapter.

Please note that the iCLCM set is still under proposal and may change.


\begin{center}
\begin{tabular}{lrll}
Message part: & Bytes: & Data: & Notes:\\
\hline
Header & 1 & Message ID & \(=10\) for iGAME\\
\hline
Container Mask & 1 & Container mask & \\
\hline
High frequency container & 4 & Rear axle location & \\
 & 4 & Controller type & \\
 & 4 & Response time constant & \\
 & 4 & Response time delay & \\
 & 4 & Target longitudinal acceleration & \\
 & 4 & Time headway & \\
 & 4 & Cruise speed & \\
\hline
(opt) Low frequency container & 1 & Low frequency mask & \\
 & 4 & (opt) Participants ready & \\
 & 4 & (opt) Start platoon & \\
 & 4 & (opt) End-of-scenario & \\
\hline
MIO & 4 & Mio ID & \\
 & 4 & Mio Range & \\
 & 4 & Mio Bearing & \\
 & 4 & Mio Range rate & \\
 &  &  & \\
\hline
Lane & 4 & Lane & \\
\hline
Pair ID & 4 & Forward ID & \\
 & 4 & Backward ID & \\
 & 4 & Acknowledgement flag & \\
\hline
Merge & 4 & Merge request & \\
 & 4 & Safe-to-merge & \\
 & 4 & Flag & \\
 & 4 & Flag tail & \\
 & 4 & Flag head & \\
\hline
Intersection & 4 & Platoon ID & \\
 & 4 & Distance travelled in CZ & \\
 & 4 & Intention & \\
 & 4 & Counter & \\
\end{tabular}
\end{center}
\end{document}
